// Найдите произведения пар чисел в одномерном массиве. Парой
// считаем первый и последний элемент, второй и предпоследний и
// т.д. Результат запишите в новый массив.
// Пример
// [1 3 2 4 2 3] => [3 6 8]
// [2 3 1 7 5 6 3] => [6 18 5] (элемент 7 не имеет пары)

int[] array = { 10, 2, 3, 4, 5, 7, 8, 11, 9 }; // 9
int[] result = new int[array.Length / 2]; // 9 / 2 = 4
for (int i = 0, j = array.Length - 1; i < result.Length; i++, j--)
// i - индекс первого элемента , i = 0
// j - индекс последнего элемента, j = array.Length - 1 (8)
{
    result[i] = array[i] * array[j];
}
Console.WriteLine($"Результат: [ {string.Join("; ", result)} ]");